app/Controllers/Admin/CategoryController.php

SELECT COUNT(*) AS `numrows`
FROM `category`
SELECT *
FROM `category`
---
    public function index()
    {
        $data = [
            "title" => "Category Page",
            "list" => $this->category->findAll(),
        ];