app/Controllers/Admin/MenuController.php

    public function index()
    {
        $data = [
            "title" => "menu Page",
            "list" => $this->menu->asObject()->paginate(5,"menu"),
---
SELECT *
FROM `menu`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `menu`