app/Controllers/Admin/ProductController.php

SELECT *
FROM `category`
---
    public function index()
    {
        $data = [
            'title' => "Daftar Product",
            'daftar_category' => $this->category->findAll()