app/Controllers/Admin/UserController.php

SELECT *
FROM `users`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $data = [
            "title" => "User Page",
            "list" => $this->user->paginate(5,"user"),